#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mindmelting/iot-neopixel/runs/run-GEJ9ZrDqGnQujqyH

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.homebridge_iam_user: Refreshing state... [id=iot-homebridge-user]
aws_iot_policy.iot_policy: Refreshing state... [id=iot-policy]
aws_lambda_layer_version.node_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:160696617623:layer:iot-node-layer:20]
aws_iam_role.lambda_iam_role: Refreshing state... [id=iot-lambda-role]
aws_iot_certificate.iot_certificate[0]: Refreshing state... [id=6a0cb67375396d178d7371b2615fa00ca1581bd8493df9652cd69c36888ffdd6]
aws_iam_policy.iot_homebridge_iam_policy: Refreshing state... [id=arn:aws:iam::160696617623:policy/iot-homebridge-policy]
aws_api_gateway_rest_api.iot: Refreshing state... [id=7wpjtqmlq5]
aws_iot_thing.iot_thing[0]: Refreshing state... [id=neopixel]
aws_iam_access_key.homebridge_iam_access_key: Refreshing state... [id=AKIASK2SDZKLW2Q7SX5D]
aws_iam_user_policy_attachment.homebridge_list_attachment: Refreshing state... [id=iot-homebridge-user-20210810052901571700000002]
aws_iam_role_policy_attachment.cloudwatch_attachment: Refreshing state... [id=iot-lambda-role-20210729072555558800000001]
aws_iam_policy.iot_shadow_iam_policy: Refreshing state... [id=arn:aws:iam::160696617623:policy/iot-shadow-policy]
aws_iot_policy_attachment.iot_policy_attachment[0]: Refreshing state... [id=iot-policy|arn:aws:iot:ap-southeast-2:160696617623:cert/6a0cb67375396d178d7371b2615fa00ca1581bd8493df9652cd69c36888ffdd6]
aws_iot_thing_principal_attachment.iot_thing_attachment[0]: Refreshing state... [id=neopixel|arn:aws:iot:ap-southeast-2:160696617623:cert/6a0cb67375396d178d7371b2615fa00ca1581bd8493df9652cd69c36888ffdd6]
aws_lambda_function.iot_gh_event: Refreshing state... [id=iot-google-home-event]
aws_lambda_function.iot_gh_state: Refreshing state... [id=iot-google-report-state]
aws_iam_role_policy_attachment.iot_attachment: Refreshing state... [id=iot-lambda-role-20210729072557236300000003]
aws_iam_user_policy_attachment.homebridge_shadow_attachment: Refreshing state... [id=iot-homebridge-user-20210810052901443900000001]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-7wpjtqmlq5-vg099h5gpl-ANY]
aws_api_gateway_resource.proxy: Refreshing state... [id=usfmjm]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-7wpjtqmlq5-usfmjm-ANY]
aws_lambda_permission.apigw_gh_event: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_iot_topic_rule.delta_iot_topic_rule: Refreshing state... [id=iot_delta_rule]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-7wpjtqmlq5-vg099h5gpl-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-7wpjtqmlq5-usfmjm-ANY]
aws_api_gateway_deployment.iot: Refreshing state... [id=ivt1s7]
aws_lambda_permission.iot_core_gh_state: Refreshing state... [id=AllowIoTGatewayInvoke]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_policy.iot_homebridge_iam_policy has been changed
  ~ resource "aws_iam_policy" "iot_homebridge_iam_policy" {
        id        = "arn:aws:iam::160696617623:policy/iot-homebridge-policy"
        name      = "iot-homebridge-policy"
      + tags      = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.iot_gh_event will be updated in-place
  ~ resource "aws_lambda_function" "iot_gh_event" {
        id                             = "iot-google-home-event"
      ~ last_modified                  = "2021-08-10T05:29:26.425+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:160696617623:layer:iot-node-layer:20",
        ] -> (known after apply)
      ~ source_code_hash               = "yw1Z1n6nVSAj6uhLJj3Ab5t9UOZ8239+IQEKSjGC/b8=" -> "jaS7MjZ+pg4vY/2lBouqDbOyDzub44q8+5Tbqx5eQWI="
        tags                           = {}
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.iot_gh_state will be updated in-place
  ~ resource "aws_lambda_function" "iot_gh_state" {
        id                             = "iot-google-report-state"
      ~ last_modified                  = "2021-08-10T05:29:38.950+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:160696617623:layer:iot-node-layer:20",
        ] -> (known after apply)
      ~ source_code_hash               = "yw1Z1n6nVSAj6uhLJj3Ab5t9UOZ8239+IQEKSjGC/b8=" -> "jaS7MjZ+pg4vY/2lBouqDbOyDzub44q8+5Tbqx5eQWI="
        tags                           = {}
        # (22 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.node_layer must be replaced
-/+ resource "aws_lambda_layer_version" "node_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-2:160696617623:layer:iot-node-layer:20" -> (known after apply)
      ~ created_date                = "2021-08-10T05:29:10.925+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-2:160696617623:layer:iot-node-layer:20" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-2:160696617623:layer:iot-node-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "hiI9DgG7HqBz1wzGQiPBer/NMFYIDLtjhczQ5J+MGJg=" -> "C/5xT6RBZrFRWK3C9n3CvobtULBu6j2zVfAUOI9SPAY=" # forces replacement
      ~ source_code_size            = 8011549 -> (known after apply)
      ~ version                     = "20" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "google_x509_cert_url"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "google_client_id" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 4 other variable(s)
│ defined without being declared.
╵

```

</details>

*Pusher: @mindmelting, Action: `pull_request`*